Repository: rmraya/TMXEditor
Catalog: docs/i18n/tmxeditor_es.ditamap.tmx
Source language: en
Languages: es

source: Editing an Existing File
es: Editar un Archivo Existente

source: In main menu, select File Open option ([ Ctrol+O ] on Windows/Linux, [ Cmd+O ] on macOS) or click the Open button on the top toolbar.
es: En el menú principal, seleccione Archivo Abrir ([ Ctrl+O ] en Windows/Linux, [ Cmd+O ] en macOS) o haga clic en el botón Abrir de la barra de herramientas superior.

source: Use the dialog that appears to select a TMX file from the file system.
es: Utilice el cuadro de diálogo que aparece para seleccionar un archivo TMX del sistema de archivos.

source: Once the selected TMX file is open, you can:
es: Una vez abierto el archivo TMX, puede:

source: Click on any text cell to begin editing. After making changes, you can either
es: Hacer clic en una celda de texto para modificarla. Después de realizar cambios, puede

source: Click outside the cell or press [ Alt+Enter ] to save your changes
es: Hacer clic fuera de la celda o pulsar [ Alt+Intro ] para guardar los cambios

source: Press the [ ESC ] key to cancel your changes
es: Pulsar la tecla [ ESC ] para cancelar los cambios

source: To add new units to the TMX file, select Edit Insert Translation Unit in main menu or click the Insert Translation Unit button from the top toolbar.
es: Para agregar nuevas unidades al archivo TMX, seleccione Editar Insertar Unidad de Traducción en el menú pricipal o haga clic en el botón Insertar Unidad de Traducción de la barra de herramientas superior.

source: To delete one or more units:
es: Para eliminar una o más unidades:

source: Select the checkbox in the leftmost column of the editing window to mark the units that you want to remove
es: Active la casilla de verificación situada en la columna situada más a la izquierda de la ventana de edición para marcar las unidades que desea eliminar

source: Select Edit Delete Selected Units in main menu or click the Delete Selected Units button on the top toolbar.
es: En el menú principal, seleccione Editar Eliminar Unidades Seleccionadas o haga clic en el botón Eliminar Unidades Seleccionadas de la barra de herramientas superior.

source: You can use the top-left checkbox to select/deselect all units at once.
es: Puede utilizar la casilla de verificación superior izquierda para seleccionar/anular la selección de todas las unidades a la vez.

source: Use the Filter Translation Units option to locate text in the file.
es: Utilice la opción Filtrar Unidades de Traducción para localizar texto en el archivo.

source: Use the Sort Translation Units option to display file entries sorted on a selected language.
es: Utilice la opción Ordenar Unidades de Traducción para mostrar las entradas de archivo ordenadas en un idioma seleccionado.

source: After making changes to the TMX file, select File Save in main menu ([ Ctrl+S ] on Windows/Linux, [ Cmd+S ] on macOS) or click the Save button on the top toolbar to save your modifications.
es: Después de realizar cambios en el archivo TMX, seleccione Archivo Guardar en el menú principal ([ Ctrl+S ] en Windows/Linux, [ Cmd+S ] en macOS) o haga clic en el botón Guardar en la barra de herramientas superior para guardar sus modificaciones.

source: Conversion Tasks
es: Tareas de Conversión

source: TMXEditor can perform the following conversions:
es: TMXEditor puede realizar las siguientes conversiones:

source: Convert Excel File to TMX
es: Convertir Archivo Excel a TMX

source: Export TMX as Excel File
es: Exportar TMX como Archivo Excel

source: Convert CSV/TAB Delimited File to TMX
es: Convertir Archivo CSV/Texto Delimitado a TMX

source: Export TMX as TAB Delimited File
es: Exportar TMX Como Archivo Delimitado por TAB

source: Convert SDLTM File to TMX
es: Convertir Archivo SDLTM a TMX

source: Convert TBX File to TMX
es: Convertir Archivo TBX a TMX

source: Prefer Excel files over CSV/TAB delimited when your data contains multiple lines of text in a single cell or translation unit.
es: Prefiera los archivos Excel a los delimitados por CSV/TAB cuando sus datos contengan varias líneas de texto en una sola celda o unidad de traducción.

source: Features
es: Funciones Disponibles

source: With TMXEditor you can:
es: Con TMXEditor puede:

source: Set attributes, properties and notes at file level
es: Establecer atributos, propiedades y notas a nivel de archivo

source: Edit segments of your TMX file to correct errors.
es: Editar segmentos de su archivo TMX para corregir errores.

source: Merge & split TMX files.
es: Combinar y dividir archivos TMX.

source: Add and remove languages from a TMX file.
es: Añadir y eliminar idiomas de un archivo TMX.

source: Change languages in a TMX file.
es: Cambiar idiomas en un archivo TMX.

source: Remove duplicates.
es: Eliminar duplicados.

source: Remove untranslated units.
es: Eliminar unidades no traducidas.

source: Remove inline tags.
es: Eliminar etiquetas.

source: Trim initial and trailing spaces.
es: Eliminar los espacios iniciales y finales.

source: Consolidate translation units when the TMX file has three or more languages.
es: Consolidar unidades de traducción cuando el archivo TMX tiene tres o más idiomas.

source: Validate TMX files.
es: Validar archivos TMX.

source: Clean invalid XML characters from a TMX file.
es: Limpiar los caracteres XML no válidos de un archivo TMX.

source: Convert to TMX format
es: Convertir a formato TMX

source: Excel files
es: Archivos Excel

source: CSV or TAB delimited files
es: Archivos CSV o delimitados por TAB

source: SDLTM files
es: Archivos SDLTM

source: TBX (TermBase eXchange) files
es: Archivos TBX (TermBase eXchange)

source: Export TMX files as
es: Exportar archivos TMX como

source: TAB Delimited files
es: Archivos delimitados por TAB

source: Getting Started
es: Primeros Pasos

source: You can use TMXEditor to edit existing TMX files and also to create new TMX files, empty or from CSV/TAB delimited data.
es: Puede utilizar TMXEditor para editar archivos TMX existentes y también para crear nuevos archivos TMX, vacíos o a partir de datos delimitados por CSV/TAB.

source: Editing an Existing TMX File
es: Editar un Archivo Existente

source: Create TMX File
es: Crear Archivo TMX

source: Convert CSV/TAB Delimited to TMX
es: Convertir Archivo CSV/Texto Delimitado a TMX

source: Introduction
es: Introducción

source: TMXEditor is a cross-platform desktop application designed for editing TMX (Translation Memory eXchange) files on macOS, Linux and Microsoft Windows.
es: TMXEditor es una aplicación de escritorio multiplataforma diseñada para editar archivos TMX (Translation Memory eXchange) en macOS, Linux y Microsoft Windows.

source: TMXEditor allows editing the content of multilingual TMX files.
es: TMXEditor permite editar el contenido de archivos TMX multilingües.

source: TMXEditor on Windows
es: TMXEditor en Windows

source: Licenses
es: Licencias

source: TMXEditor uses components from these open source projects:
es: TMXEditor utiliza componentes de estos proyectos de código abierto:

source: Available from https://www.electronjs.org/
es: Disponible en https://www.electronjs.org/

source: Published under MIT License
es: Publicado bajo la Licencia MIT

source: Available from https://adoptium.net/
es: Disponible en https://adoptium.net/

source: Published under GPL with CLASSPATH Exception
es: Publicado bajo GPL with CLASSPATH Exception

source: Available from https://github.com/rmraya/BCP47J
es: Disponible en https://github.com/rmraya/BCP47J

source: Published under Eclipse Public License 1.0
es: Publicado bajo la Licencia Pública Eclipse 1.0

source: Available from https://github.com/stleary/JSON-java
es: Disponible en https://github.com/stleary/JSON-java

source: Public domain
es: Dominio público

source: Available from https://github.com/rmraya/sdltm
es: Disponible en https://github.com/rmraya/sdltm

source: Available from https://slf4j.org
es: Disponible en https://slf4j.org

source: Available from https://github.com/xerial/sqlite-jdbc
es: Disponible en https://github.com/xerial/sqlite-jdbc

source: Published under Apache License
es: Publicado bajo la Licencia Apache

source: Available from https://www.maxprograms.com/products/tmxvalidator.html
es: Disponible en https://www.maxprograms.com/products/tmxvalidator.html

source: Available from https://github.com/rmraya/TypesXML
es: Disponible en https://github.com/rmraya/TypesXML

source: Available from https://github.com/rmraya/XMLJava
es: Disponible en https://github.com/rmraya/XMLJava

source: Maintenance Tasks
es: Tareas de Mantenimiento

source: TMXEditor maintenance options are
es: Las opciones de mantenimiento de TMXEditor son

source: Set Attributes, Properties and Notes at File Level
es: Establecer Atributos, Propiedades y Notas a Nivel de Archivo

source: Maintenance Dashboard
es: Panel de Mantenimiento

source: Sort Translation Units
es: Ordenar Unidades de Traducción

source: Filter Translation Units
es: Filtrar Unidades de Traducción

source: Search & Replace Text
es: Buscar y Remplazar Texto

source: Change Language
es: Cambiar Idioma

source: Add Language
es: Añadir Idioma

source: Remove Language
es: Eliminar Idioma

source: Change Source Language
es: Cambiar Idioma Origen

source: Remove Inline Tags
es: Eliminar Etiquetas

source: Remove Duplicated Units
es: Eliminar Unidades Duplicadas

source: Remove Translation Same as Source
es: Eliminar Traducciones Iguales a Origen

source: Remove Initial & Trailing Spaces
es: Eliminar Espacios Iniciales y Finales

source: Consolidate Translation Units
es: Consolidar Unidades de Traducción

source: Split TMX File
es: Dividir Archivo TMX

source: Merge TMX Files
es: Combinar Archivos TMX

source: Subscriptions
es: Suscripciones

source: TMXEditor is available in two modes:
es: TMXEditor está disponible en dos modos:

source: Source Code
es: Código Fuente

source: Yearly Subscriptions for installers and support
es: Suscripciones Anuales para instaladores y soporte técnico

source: Source code of TMXEditor is free. Anyone can download the source code from Github.com , compile, modify and use it at no cost in compliance with the accompanying license terms.
es: El código fuente de TMXeditor es libre. Cualquiera puede descargar el código fuente de Github.com , compilarlo, modificarlo y utilizarlo sin costo alguno respetando los términos de la licencia adjunta.

source: Ready to use installers and technical support for TMXEditor are available as yearly subscriptions at Maxprograms Online Store .
es: Instaladores listos para usar y soporte técnico para TMXEditor están disponibles como suscripciones anuales en la Tienda en Línea de Maxprograms .

source: The version of TMXEditor included in the official installers can be used at no cost for 7 days requesting a free Evaluation Key.
es: La versión de TMXEditor incluida en los instaladores oficiales puede utilizarse sin costo durante 7 días solicitando un código de evaluación gratuito.

source: Subscription Keys cannot be shared or transferred to different machines.
es: Las claves de suscripción no se pueden compartir ni transferir a diferentes máquinas.

source: Differences Summary
es: Resumen de Diferencias

source: Subscription Based
es: Por Suscripción

source: Ready To Use Installers
es: Instaladores listos para usar

source: Yes
es: Si

source: Notarized macOS launcher
es: Ejecutable de macOS notariado

source: Signed launcher and installer for Windows
es: Ejecutable e instalador para Windows firmado digitalmente

source: Associate app with .tmx extension on Windows and macOS
es: Asociar la aplicación con la extensión .tmx en Windows y macOS

source: Restricted Features
es: Características Restringidas

source: None
es: Ninguna

source: Technical Support
es: Soporte Técnico

source: Peer support at Groups.io
es: Apoyo de otros usuarios en Groups.io

source: Direct email at tech@maxprograms.com
es: Correo electrónico directo a tech@maxprograms.com

source: Supported Platforms
es: Plataformas Compatibles

source: TMXEditor works on these Operating Systems:
es: TMXEditor funciona en estos sistemas operativos:

source: Microsoft Windows 10 and 11
es: Microsoft Windows 10 y 11

source: macOS Big Sur (11.0), Monterey (12.0), Ventura (13.0), Sonoma (14.0) and Sequoia (15.0)
es: macOS Big Sur (11.0), Monterey (12.0), Ventura (13.0), Sonoma (14.0) y Sequoia (15.0)

source: Linux (with GNOME Desktop Manager)
es: Linux (con GNOME Desktop Manager)

source: Translation Memory eXchange (TMX) is an open standard originally published by LISA (Localization Industry Standards Association). The purpose of TMX is to allow easier exchange of translation memory data between tools and/or translation vendors with little or no loss of critical data during the process.
es: Translation Memory eXchange (TMX) es un estándar abierto publicado originalmente por LISA (Localization Industry Standards Association). El propósito de TMX es permitir un intercambio más fácil de datos de memorias de traducción entre herramientas y/o proveedores de traducción con poca o ninguna pérdida de datos críticos durante el proceso.

source: Character Set
es: Juego de Caracteres

source: A character set (sometimes referred to as code page) is a collection of characters that are associated with a sequence of natural numbers in order to facilitate the storage of text in computers and the transmission of text through telecommunication networks.
es: Un juego de caracteres (a veces denominado página de códigos) es una colección de caracteres que están asociados con una secuencia de números naturales para facilitar el almacenamiento de texto en computadoras y la transmisión de texto a través de redes de telecomunicaciones.

source: Language Code
es: Código de Idioma

source: A language code is a code that assigns letters or numbers as identifiers or classifiers for languages. Language codes used in TMX files must comply with the rules defined by BCP 47 - Tags for Identifying Languages
es: Un código de idioma es un código que asigna letras o números como identificadores o clasificadores de idiomas. Los códigos de idioma utilizados en los archivos TMX deben cumplir las normas definidas en la BCP 47 - Etiquetas para la identificación de idiomas .

source: Source Language
es: Idioma Origen

source: The language of a document that is to be translated.
es: El idioma de un documento que se va a traducir.

source: Subscription Key
es: Clave de Suscripción

source: A Subscription key is a short text code that lets you register and use a software program during a pre-established time period.
es: Una clave de suscripción es un código de texto corto que le permite registrar y utilizar un programa de software durante un periodo de tiempo preestablecido.

source: Translation Memory
es: Memoria de Traducción

source: Translation Memory (TM) is a language technology that enables the translation of segments (paragraphs, sentences or phrases) of documents by searching for similar segments in a database and suggesting matches that are found in the databases as possible translations.
es: La Memoria de Traducción (MT) es una tecnología lingüística que permite traducir segmentos (párrafos, frases u oraciones) de documentos mediante la búsqueda de segmentos similares en una base de datos y la sugerencia de coincidencias encontradas en las bases de datos como posibles traducciones.

source: Translation Unit
es: Unidad de Traducción

source: A translation unit (represented by the <tu> element in a TMX file) contains a piece of source text and optional translation and metadata related to that piece of text.
es: Una unidad de traducción (representada por el elemento <tu> en un archivo TMX) contiene un fragmento de texto origen y una traducción y metadatos opcionales relacionados con ese fragmento de texto.

source: Follow these steps to add a language to a TMX file.
es: Siga estos pasos para añadir un idioma a un archivo TMX.

source: Open the TMX file that you want to modify.
es: Abra el archivo TMX que desea modificar.

source: In main menu, select Tasks Add Language... .
es: En el menú principal, seleccione Tareas Añadir Idioma... .

source: The following dialog appears:
es: Aparece el siguiente cuadro de diálogo:

source: Add Language Dialog
es: Cuadro de diálogo Añadir Idioma

source: Use the drop-down box to select the language to add.
es: Use la lista desplegable para seleccionar el idioma a añadir.

source: Click the Add Language button.
es: Haga clic en el botón Añadir Idioma .

source: The dialog closes and the editing window is refreshed to reflect the changes.
es: El cuadro de diálogo se cierra y la ventana de edición se actualiza para reflejar los cambios.

source: Follows these steps to change a language code used in a TMX file
es: Siga estos pasos para cambiar un código de idioma usado en un archivo TMX.

source: Most Translation Memory (TM) systems are sensitive to language codes . A TM system may normally consider that the code "en" (English) is different from "en-US" (English for the United States) or "en-GB" (English for the United Kingdom)
es: La mayoría de los sistemas de Memoria de Traducción (TM) son sensibles a los códigos de idioma . Un sistema de TM puede considerar normalmente que el código "en" (inglés) es diferente de "en-US" (inglés para los Estados Unidos) o "en-GB" (inglés para el Reino Unido)

source: TMXEditor allows you to change the language codes used in a TMX file.
es: TMXEditor permite cambiar los códigos de idioma utilizados en un archivo TMX.

source: In main menu, select Tasks Change Language... .
es: En el menú principal, seleccione Tareas Cambiar Idioma... .

source: Change Language Dialog
es: Cuadro de diálogo Cambiar Idioma

source: Use the Current Language drop-down box to select the language that you want to change.
es: Use la lista desplegable Idioma Actual para seleccionar el idioma que desea cambiar.

source: Use the New Language drop-down box to select the new language.
es: Use la lista desplegable Nuevo Idioma para seleccionar el nuevo idioma.

source: Click the Change Language button.
es: Haga clic en el botón Cambiar Idioma .

source: Follow the steps to change the source language of a TMX file.
es: Siga estos pasos para cambiar el idioma origen usado en un archivo TMX.

source: Some Translation Memory systems use bilingual TMX files and translate in only one direction.
es: Algunos sistemas de Memoria de Traducción utilizan archivos TMX bilingües y traducen en una sola dirección.

source: Use this option to select the source language of your TMX file for systems that cannot translate in any direction.
es: Utilice esta opción para seleccionar el idioma origen del archivo TMX para sistemas que no pueden traducir en cualquier dirección.

source: In main menu, select Tasks Change Source Language... option.
es: En el menú principal, seleccione Tareas Cambiar Idioma Origen... .

source: Change Source Language Dialog
es: Cuadro de diálogo Cambiar Idioma Origen

source: Use the Language drop-down box to select the new source language.
es: Use la lista desplegable Idioma para seleccionar el nuevo idioma origen.

source: The Language drop-down control includes Any Language as first entry. Use this option to indicate that the file can be used in any direction.
es: La lista desplegable Idioma incluye Cualquier Idioma como primera entrada. Utilice esta opción para indicar que el archivo puede utilizarse en cualquier dirección.

source: Click the Change Source Language button.
es: Haga clic en el botón Cambiar Idioma Origen .

source: Clean Invalid Characters
es: Limpiar Caracteres Inválidos

source: Follow these steps to remove invalid characters from a TMX file.
es: Siga estos pasos para eliminar caracteres inválidos de un archivo TMX.

source: TMX is an XML-based vocabulary and thereafter a TMX file must not contain characters not allowed by the XML standard.
es: TMX es un vocabulario basado en XML y, por esa razón, un archivo TMX no debe contener caracteres no permitidos por el estándar XML.

source: A TMX file that contains invalid characters cannot be edited without removing those characters first.
es: Un archivo TMX que contiene caracteres no válidos no se puede editar sin eliminar primero esos caracteres.

source: In main menu, select File Clean Invalid Characters... .
es: En el menú principal, seleccione Archivo Limpiar Caracteres Inválidos... .

source: Use the dialog that appears to locate and select the file that you want to repair.
es: Utilice el cuadro de diálogo que aparece para localizar y seleccionar el archivo que desea reparar.

source: A progress indicator is displayed while the selected file is cleaned and a backup of the original data is saved in the same folder.
es: Se muestra un indicador de progreso mientras se limpia el archivo seleccionado y se guarda una copia de seguridad de los datos originales en la misma carpeta.

source: Follow these steps to consolidate units in a TMX file with three or more languages.
es: Siga estos pasos para consolidar unidades de traducción an un archivo TMX que tiene tres o más idiomas.

source: In files with three or more languages, it is possible that translations of a given source text into different languages appear in different translation units, as illustrated by the following image.
es: En archivos con tres o más idiomas, es posible que las traducciones de un texto de origen determinado a diferentes idiomas aparezcan en diferentes unidades de traducción, como se ilustra en la siguiente imagen.

source: Needs Consolidation Example
es: Ejemplo de Unidades Que Necesitan Consolidación

source: Consolidating units puts all related translations in the same unit. The following image shows the consolidated version of the one above.
es: Consolidar unidades coloca todas las traducciones relacionadas en una misma unidad. La siguiente imagen muestra la versión consolidada de la anterior.

source: Consolidated Units Example
es: Ejemplo de Unidades Consolidadas

source: Open the TMX file that you want to consolidate.
es: Abra el archivo TMX que desea consolidar.

source: In main menu, select Tasks Consolidate Units... .
es: En el menú principal, seleccione Tareas Consolidar Unidades... .

source: Consolidate Units Dialog
es: Cuadro de diálogo Consolidar Unidades

source: Use the Source Language drop-down to select the language to be considered source language for merging units (it may differ from the source language set at file level).
es: Utilice la lista desplegable Idioma Origen para seleccionar el idioma que se considerará idioma origen para combinar unidades (puede diferir del idioma de origen establecido a nivel de archivo).

source: Click the Consolidate Units button.
es: Haga clic en el botón Consolidar Unidades .

source: A progress indicator is displayed while units are consolidated. The editing window is refreshed to reflect the changes.
es: Se muestra un indicador de progreso mientras se consolidan las unidades. La ventana de edición se actualiza para reflejar los cambios.

source: Follow these steps to create a new TMX file.
es: Siga estos pasos para crear un nuevo archivo TMX.

source: In main menu, select File New option ([ Ctrl+N ] on Windows/Linux, [ Cmd+N ] on macOS) or click the New button from the top toolbar.
es: En el menú principal, seleccione la opción Archivo Nuevo ([ Ctrl+N ] en Windows/Linux, [ Cmd+N ] en macOS) o haga clic en el botón Nuevo de la barra de herramientas superior.

source: New TMX File Dialog
es: Cuadro de diálogo Nuevo Archivo TMX

source: Use the Source Language drop-down to select the language of source text.
es: Use la lista desplegable Idioma Origen para seleccionar el idioma origen.

source: Use the Target Language drop-down to select the target language.
es: Use la lista desplegable Idioma Destino para seleccionar el idioma destino.

source: Click the Create TMX File button.
es: Haga clic en el botón Crear Archivo TMX .
